Tekla Open API Reference for Tekla Structures 2025
StraightDimension.Distance Property
 Gets or sets the distance of the dimension line from the start point of the dimension.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Distance { get; }
Public ReadOnly Property Distance As Double
	Get
Property Value
Type: Double
See Also
Reference
StraightDimension Class
Tekla.Structures.Drawing Namespace